#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаказаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура СогласованиеУсловийПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура СогласованиеСКлиентомПроверкаУсловия(ТочкаМаршрута, Результат)	
	Результат = СогласованиеЗаказа;
КонецПроцедуры

Процедура СоставлениеЧекЛистаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Тестировщик);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ТестированиеПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.УдаленныйТестировщик);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПодготовкаОтчётаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Тестировщик);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗавершитьРасчётСЗаказчикомПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПроизвестиРасчётУТПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗакрытьЗаказПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		Записать();
	КонецЦикла;
КонецПроцедуры


Процедура УстановитьПользователя(Задача, ТипПользователя)
	УИдентификатор = Неопределено;
	
	Если ТипПользователя = Перечисления.ТипыПользователей.Менеджер Тогда 
		УИдентификатор = ЭтотОбъект.Менеджер.Пользователь;
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.Тестировщик Тогда 
		УИдентификатор = ЭтотОбъект.Тестировщик.Пользователь;
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.УдаленныйТестировщик Тогда 
		УИдентификатор = ЭтотОбъект.УдаленныйТестировщик.Пользователь;
	КонецЕсли;
	
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор", УИдентификатор);
	Задача.Исполнитель = Пользователь;
	//Записать();
КонецПроцедуры

Процедура УстановитьСтатусЗадачи(Задача, Статус)
	Задача.Статус = Статус;
	//Записать();
КонецПроцедуры

#Иначе
  ВызватьИсключение НСтр("en = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли