
&НаКлиенте
Процедура КомандаОбновитьСписок(Команда)
	КомандаОбновитьСписокНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьСписокНаСервере()
	ТекущийДокументОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийДокументОбъект.ЗаказыВРаботе.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "Выбрать 
	|заказы.Код,
	|заказы.Название
	|ИЗ Справочник.Заказы КАК заказы
	|ГДЕ заказы.Выполнен = ЛОЖЬ И заказы.РабочаяГруппа = &ТекущийДокументСсылка И заказы.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ТекущийДокументСсылка", ТекущийДокументОбъект.Ссылка);
	Результат = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = Результат.Выбрать();    
	
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
 	 	НовСтр = ТекущийДокументОбъект.ЗаказыВРаботе.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
    КонецЦикла;
    
	ЗначениеВРеквизитФормы(ТекущийДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КомандаОбновитьСписокНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.УникальныйИдентификатор = Новый УникальныйИдентификатор();
КонецПроцедуры

