&НаКлиенте
Перем УИдентификатор;

&НаКлиенте
Перем ТипПользователя;

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	ИнициализироватьДанныеНаУдаление(Элементы.Список.ТекущаяСтрока);	
	Сообщить(УИдентификатор);	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	УдалитьСвязанныеЗаписи(ТипПользователя, УИдентификатор);
КонецПроцедуры

&НаСервере
Процедура УдалитьСвязанныеЗаписи(ТипПользователя,УИдентификатор)
	Запрос = новый Запрос;
	
	Если ТипПользователя = Перечисления.ТипыПользователей.Тестировщик Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|Тестировщики.ФамилияИмяОтчество,
		|Тестировщики.Ссылка
		|ИЗ Справочник.Тестировщики КАК Тестировщики";	
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	ЗаписиНаУдаление = Результат.Выбрать();
	Пока ЗаписиНаУдаление.Следующий() Цикл
		Если ЗаписиНаУдаление.УникальныйИдентификатор = УИдентификатор Тогда
			Сообщить(ЗаписиНаУдаление.ФамилияИмяОтчество + " удален!")
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьДанныеНаУдаление(СсылкаНаЭлемент)
	Пользователь = СсылкаНаЭлемент.ПолучитьОбъект();
	УИдентификатор = Пользователь.УникальныйИдентификатор;	
	ТипПользователя = Пользователь.ТипПользователя;	
КонецПроцедуры

