&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЛогинУникальный() Тогда
		ДобавитьПользователя();
	Иначе
		Сообщить("Пользователь с таким логином уже зарегистрирован.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЛогинУникальный()
	Результат = Ложь;	
	ТекущийОбъект = ЭтаФорма.Object;
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Логин", ТекущийОбъект.Логин);
	
	Если Пользователь.Пустая() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ДобавитьПользователя()
	
	ТекущийОбъект = ЭтаФорма.Object;
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = ТекущийОбъект.Логин;
	Пользователь.Логин = ТекущийОбъект.Логин;
	Пользователь.ФамилияИмяОтчество = ТекущийОбъект.ФамилияИмяОтчество;
	Пользователь.ТипПользователя = ТекущийОбъект.ТипПользователя;
	Пользователь.УникальныйИдентификатор = Новый УникальныйИдентификатор();
	
	Если Пользователь.ТипПользователя = Перечисления.ТипыПользователей.Тестировщик Тогда
		ДобавитьУчастника(Справочники.Тестировщики, Пользователь);
	ИначеЕсли Пользователь.ТипПользователя = Перечисления.ТипыПользователей.УдаленныйТестировщик Тогда
		ДобавитьУчастника(Справочники.УдаленныеТестировщики, Пользователь);
	ИначеЕсли Пользователь.ТипПользователя = Перечисления.ТипыПользователей.Заказчик Тогда
		ДобавитьУчастника(Справочники.Заказчики, Пользователь);
	ИначеЕсли Пользователь.ТипПользователя = Перечисления.ТипыПользователей.Менеджер Тогда
		ДобавитьУчастника(Справочники.Менеджеры, Пользователь);
	Иначе
		Сообщить("Не верно указан тип пользователя.");
		Возврат;
	КонецЕсли;
		
	Пользователь.Записать();
	СоздатьПользователя(Пользователь);
	Сообщить("Пользователь добавлен.");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователя(Пользователь)
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользователь.Имя = Пользователь.Логин;
	НовыйПользователь.ПолноеИмя = Пользователь.ФамилияИмяОтчество;
	
	УстановитьРольПользователю(НовыйПользователь, Пользователь.ТипПользователя);
	
	НовыйПользователь.Записать();
КонецПроцедуры

&НаСервере
Процедура УстановитьРольПользователю(Пользователь, ТипПользователя)
	Если ТипПользователя = Перечисления.ТипыПользователей.Заказчик Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.Заказчик);
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.Тестировщик Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.Тестировщик);
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.УдаленныйТестировщик Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.УдаленныйТестировщик);
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.Менеджер Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.Менеджер);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьУчастника(Справочник, Пользователь)
	Участник = Справочник.СоздатьЭлемент();
	Участник.Пользователь = Пользователь.УникальныйИдентификатор;
	Участник.ФамилияИмяОтчество = Пользователь.ФамилияИмяОтчество;
	Участник.Наименование = Пользователь.ФамилияИмяОтчество;
	
	Попытка
		Участник.Записать();
		Сообщить("Участник добавлен.")
	Исключение
		Сообщить("Не удалось добавить участника!");
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьМенеджера(Пользователь)
	Менеджер = Справочники.Менеджеры.СоздатьЭлемент();
	Менеджер.Пользователь = Пользователь.УникальныйИдентификатор;
	Менеджер.ФамилияИмяОтчество = Пользователь.ФамилияИмяОтчество;
	Менеджер.Наименование = Пользователь.ФамилияИмяОтчество;
	
	Попытка
		Менеджер.Записать();
		Сообщить("Менеджер добавлен.")
	Исключение
		Сообщить("Не удалось добавить менеджера!");
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаказчика(Пользователь)
	Заказчик = Справочники.Заказчики.СоздатьЭлемент();
	Заказчик.Пользователь = Пользователь.УникальныйИдентификатор;
	Заказчик.ФамилияИмяОтчество = Пользователь.ФамилияИмяОтчество;
	Заказчик.Наименование = Пользователь.ФамилияИмяОтчество;
	
	Попытка
		Заказчик.Записать();
		Сообщить("Заказчик добавлен.")
	Исключение
		Сообщить("Не удалось добавить заказчика!");
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУдаленногоТестировщика(Пользователь)
	УдаленныйТестировщик = Справочники.УдаленныеТестировщики.СоздатьЭлемент();
	УдаленныйТестировщик.Пользователь = Пользователь.УникальныйИдентификатор;
	УдаленныйТестировщик.ФамилияИмяОтчество = Пользователь.ФамилияИмяОтчество;
	УдаленныйТестировщик.Наименование = Пользователь.ФамилияИмяОтчество;
	УдаленныйТестировщик.Квалификация = Перечисления.КвалификацииУдаленныхТестировщиков.Начальный;
	
	Попытка
		УдаленныйТестировщик.Записать();
		Сообщить("Удаленный тестировщик добавлен.")
	Исключение
		Сообщить("Не удалось добавить Удаленного тестировщик!");
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТестировщика(Пользователь)
	Тестировщик = Справочники.Тестировщики.СоздатьЭлемент();
	Тестировщик.Пользователь = Пользователь.УникальныйИдентификатор;
	Тестировщик.ФамилияИмяОтчество = Пользователь.ФамилияИмяОтчество;
	Тестировщик.Наименование = Пользователь.ФамилияИмяОтчество;
	
	Попытка
		Тестировщик.Записать();
		Сообщить("Тестировщик добавлен.")
	Исключение
		Сообщить("Не удалось добавить тестировщика!");
	КонецПопытки
	
КонецПроцедуры

