&НаСервере
// Добавить запись о заказе рабочей группе.
// 
// Параметры:
//  РабочаяГруппа Рабочая группа
//  НаименованиеЗаказа Наименование заказа
//  НомерБизнесПроцесса Номер бизнес процесса
Процедура ДобавитьЗаписьОЗаказеРабочейГРуппе(РабочаяГруппа, НаименованиеЗаказа, НомерБизнесПроцесса) Экспорт
	НоваяЗаписьОЗаказе = РабочаяГруппа.ЗаказыВРаботе.Добавить();
	НоваяЗаписьОЗаказе.Заказчик = ПараметрыСеанса.ТекущийПользователь;
	НоваяЗаписьОЗаказе.Заказ = Справочники.Заказы.НайтиПоНаименованию(НаименованиеЗаказа);
	НоваяЗаписьОЗаказе.БизнесПроцесс = БизнесПроцессы.ПредоставлениеУслугУдаленногоТестирования.НайтиПоНомеру(НомерБизнесПроцесса);
	РабочаяГруппа.Записать();
КонецПроцедуры