
&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура Исполнитель1АвтоПодбор1(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УИдентификатор = Объект.БизнесПроцесс.Менеджер.Пользователь;
	Исполнитель = ПолучитьПользователя(УИдентификатор);
	Для Каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя = "Исполнитель" Тогда
			Реквизит = Исполнитель;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры



&НаСервере
Функция ПолучитьПользователя(УИдентификатор)
	Исполнитель = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор", УИдентификатор);
	Возврат Исполнитель;
КонецФункции

&НаКлиенте
Процедура Согласовать(Команда)
	СогласоватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере()
	ТекущийБизнесПроцесс = БизнесПроцессы.ПредоставлениеУслугУдаленногоТестирования.НайтиПоНомеру(Объект.БизнесПроцесс.Номер);
	ТекущийБизнесПроцесс.СогласованиеЗаказа = Истина;
КонецПроцедуры

