
&НаКлиенте
Процедура Согласовать(Команда)
	СогласоватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере()
	ТекущийБизнесПроцесс = БизнесПроцессы.ПредоставлениеУслугУдаленногоТестирования.НайтиПоНомеру(Объект.БизнесПроцесс.Номер);
	ТекущийБизнесПроцесс.СогласованиеЗаказа = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Утвердить(Команда)
	УтвердитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УтвердитьНаСервере()
	ТекущийБизнесПроцесс = БизнесПроцессы.ПредоставлениеУслугУдаленногоТестирования.НайтиПоНомеру(Объект.БизнесПроцесс.Номер);
	ТекущийБизнесПроцесс.УтверждениеЧекЛиста = Истина;	
КонецПроцедуры

