&НаСервере
Перем РабочаяГруппаСсылка;

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	НовыйБизнесПроцесс = СоздатьБизнесПроцесс();
	Если НовыйБизнесПроцесс = Неопределено Тогда
		Отказ = Истина;
	Иначе
		НовыйБизнесПроцесс.Старт();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПоУмолчанию()
	ТекущийПользователь =  ПараметрыСеанса.ТекущийПользователь;
	ЭтаФорма.Объект.Заказчик = ПолучитьЗаказчика(ТекущийПользователь.УникальныйИдентификатор);
	ЭтаФорма.Объект.Дата = ТекущаяДатаСеанса();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаказчика(УИдетификатор)
	Заказчик = Справочники.Заказчики.НайтиПоРеквизиту("Пользователь", УИдетификатор);	
	Возврат Заказчик;
КонецФункции

&НаСервере
Функция СоздатьБизнесПроцесс()
	НовыйБизнесПроцесс = Неопределено;
	РегистрацияЗаказа = ЭтотОбъект.Объект;
	РабочаяГруппа = ПолучитьДоступнуюРабочуюГруппу(); 
	Если РабочаяГруппа = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найдена доступная рабочая группа";
		Сообщение.Сообщить();
	Иначе
		НовыйБизнесПроцесс = БизнесПроцессы.ПредоставлениеУслугУдаленногоТестирования.СоздатьБизнесПроцесс();
		НовыйБизнесПроцесс.Заказчик = ПараметрыСеанса.ТекущийПользователь;
		НовыйБизнесПроцесс.Менеджер = РабочаяГруппа.Менеджер;
		НовыйБизнесПроцесс.Тестировщик = РабочаяГруппа.Тестировщик;
		НовыйБизнесПроцесс.УдаленныйТестировщик = РабочаяГруппа.УдаленныйТестировщик;
		НовыйБизнесПроцесс.ОписаниеЗадачи = РегистрацияЗаказа.Комментарии;
		НовыйБизнесПроцесс.Дата = ТекущаяДатаСеанса();	
		НовыйБизнесПроцесс.Записать();
		ОбъектРабочаяГруппа = РабочаяГруппа.ПолучитьОбъект();
		НовыйЗаказВРабочуюГруппу = ОбъектРабочаяГруппа.ЗаказыВРаботе.Добавить();
		НовыйЗаказВРабочуюГруппу.Заказ = СоздатьЗаказ(НовыйБизнесПроцесс.Ссылка, РабочаяГруппа);
		ОбъектРабочаяГРуппа.Записать();
	КонецЕсли;
	
	Возврат НовыйБизнесПроцесс;
КонецФункции

&НаСервере
Функция СоздатьЗаказ(БизнесПроцесс, РабочаяГруппа)
	НовыйЗаказ = Справочники.Заказы.СоздатьЭлемент();
	НовыйЗаказ.Название = "Заказ №" + МестноеВремя(ТекущаяДатаСеанса());
	НовыйЗаказ.БизнесПроцесс = БизнесПроцесс;
	НовыйЗаказ.РабочаяГруппа = РабочаяГруппа;
	НовыйЗаказ.Выполнен = Ложь;
	НовыйЗаказ.Заказчик = Справочники.Заказчики.НайтиПоРеквизиту("Пользователь", ПараметрыСеанса.ТекущийПользователь.УникальныйИдентификатор);
	НовыйЗаказ.Записать();
	Возврат НовыйЗаказ.Ссылка;
КонецФункции

&НаСервере
Функция ПолучитьДоступнуюРабочуюГруппу()
	ДоступнаяРабочаяГруппа = Неопределено;
	Запрос = Новый Запрос();
	Запрос.Текст = "Выбрать 
	|РГ.Наименование, 
	|РГ.Ссылка 
	|ИЗ Справочник.РабочиеГруппы 
	|КАК РГ 
	|ГДЕ РГ.НаСмене = ИСТИНА";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий()	Цикл
			ДоступнаяРабочаяГруппа = Выборка.Ссылка;
			Возврат ДоступнаяРабочаяГруппа;
		КонецЦикла;
	КонецЕсли;
	Возврат ДоступнаяРабочаяГруппа;
КонецФункции